### Mengimport package pandas

In [2]:
import pandas as pd

### Mengimport dan membaca file "DataAbalyst.csv"

In [3]:
df = pd.read_csv("DataAnalyst.csv")

### Menampilkan panjang record dataset

In [5]:
df.shape

(2253, 16)

### Mengecek null atribut

In [6]:
df.isna().sum()

Unnamed: 0           0
Job Title            0
Salary Estimate      0
Job Description      0
Rating               0
Company Name         1
Location             0
Headquarters         0
Size                 0
Founded              0
Type of ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
Easy Apply           0
dtype: int64

### Menampilkan nformasi dataset meliputi,
#### - jumlah record,
#### - nama attribute,
#### - jumlah attribute dengan tipe data object,
#### - jumlah attribute dengan tipe data angka,
#### - dan jumlah attribute yang memiliki nilai null.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2253 entries, 0 to 2252
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         2253 non-null   int64
 1   Job Title          2253 non-null   object
 2   Salary Estimate    2253 non-null   object
 3   Job Description    2253 non-null   object
 4   Rating             2253 non-null   float64
 5   Company Name       2252 non-null   object
 6   Location           2253 non-null   object
 7   Headquarters       2253 non-null   object
 8   Size               2253 non-null   object
 9   Founded            2253 non-null   int64
 10  Type of ownership  2253 non-null   object
 11  Industry           2253 non-null   object
 12  Sector             2253 non-null   object
 13  Revenue            2253 non-null   object
 14  Competitors        2253 non-null   object
 15  Easy Apply         2253 non-null   object
dtypes: float64(1), int64(2), object(13)
memory usage: 281.8+ KB

### Masukkan informasi di atas ke dalam dictionary dengan key sesuai nama informasinya. Lalu menampilkan isi dari dictionary tersebut sebagus mungkin.

In [37]:
dictionary = {"Jumlah Record Dataset" : df.size,
    "Nama Atribute" : df.columns,
    "Atribute dengan tipe data object" : [len(df.select_dtypes(["object"]).columns)],
    "Atribute dengan tipe data angka" : [len(df.select_dtypes(["int64", "float64"]).columns)],
    "Atribute yang memiliki nilai null" : [len(df.loc[:, df.isna().any()].columns)]}


print("-----------------------------------------------------------")
print("===========================================================")
print("    ")
print("                ** TAMPILAN INFORMASI **\n                      DATA ANALYST")
print("    ")
print("===========================================================")
print("|  Jumlah Record Dataset                    :", dictionary.get("Jumlah Record Dataset"), "      |") 

print("|----------------------------------------------------------") 
print("|  Nama Atribute                            :", "            |") 


for i in range (len(dictionary["Nama Atribute"])):
    print("| ", dictionary["Nama Atribute"][i])
    i+=1
    
print("|----------------------------------------------------------") 

print("|  Jumlah atribute dengan tipe object       :", dictionary.get("Atribute dengan tipe data object"), "       |")
print("|----------------------------------------------------------") 

print("|  Jumlah atribute dengan tipe data angka   :", dictionary.get("Atribute dengan tipe data angka"), "       |")
print("|----------------------------------------------------------")
print("|  Jumlah atribute yang memiliki nilai nul  :", dictionary.get("Atribute yang memiliki nilai null"), "       |")
print("===========================================================")
print("    ")
print("===========================================================")
print("-----------------------------------------------------------")

-----------------------------------------------------------
===========================================================

                ** TAMPILAN INFORMASI **
                      DATA ANALYST

===========================================================
|  Jumlah Record Dataset                    : 36048       |
|----------------------------------------------------------
|  Nama Atribute                            :             |
|  Unnamed: 0
|  Job Title
|  Salary Estimate
|  Job Description
|  Rating
|  Company Name
|  Location
|  Headquarters
|  Size
|  Founded
|  Type of ownership
|  Industry
|  Sector
|  Revenue
|  Competitors
|  Easy Apply
|----------------------------------------------------------
|  Jumlah atribute dengan tipe object       : [13]        |
|----------------------------------------------------------
|  Jumlah atribute dengan tipe data angka   : [3]        |
|----------------------------------------------------------
|  Jumlah atribute yang memiliki nilai nul  : [1]        |
===========================================================

===========================================================
-----------------------------------------------------------

### Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [9]:
df.describe()

       Unnamed: 0       Rating      Founded
count   2253.0000  2253.000000  2253.000000
mean    1126.0000     3.160630  1398.522858
std      650.5294     1.665228   901.929251
min        0.0000    -1.000000    -1.000000
25%      563.0000     3.100000    -1.000000
50%     1126.0000     3.600000  1979.000000
75%     1689.0000     4.000000  2002.000000
max     2252.0000     5.000000  2019.000000

### Menampilkan nilai korelasi attribute bertipe angka.

In [10]:
df.corr()

            Unnamed: 0    Rating   Founded
Unnamed: 0    1.000000  0.043610  0.052124
Rating        0.043610  1.000000  0.500465
Founded       0.052124  0.500465  1.000000

### Merubah nilai salah satu attribute bertipe angka menjadi desimal 3 angka dibelakang koma jika tidak ada, lakukan sebaliknya (dari desimal menjadi bilangan bulat).

In [39]:
df["Rating"] = df["Rating"].astype("float64")
df.select_dtypes(include=["int64", "float64"]).applymap("{:.3f}".format, "ignore")

     Unnamed: 0  Rating   Founded
0         0.000   3.200  1961.000
1         1.000   3.800  1893.000
2         2.000   3.400  2003.000
3         3.000   4.100  2002.000
4         4.000   3.900  2009.000
...         ...     ...       ...
2248   2248.000   2.500    -1.000
2249   2249.000   2.900  1935.000
2250   2250.000  -1.000    -1.000
2251   2251.000   3.100  1984.000
2252   2252.000   3.400  1864.000

[2253 rows x 3 columns]

### Menampilkan 10 record pertama dari attribute bertipe angka.
#### (*Tipe data integer*)

In [12]:
df[["Founded"]].head(10)

   Founded
0     1961
1     1893
2     2003
3     2002
4     2009
5     2014
6     2001
7     1914
8     1896
9     2013

### Menyimpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [13]:
df.select_dtypes(include=["int64", "float64"]).to_csv("Atribute_angka.csv")